app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Alex "], ["title", "First Post"], ["content", "here's my first post"], ["created_at", "2016-03-29 13:31:53.441559"], ["updated_at", "2016-03-29 13:31:53.441559"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save